function deaccentify(string) {
    [
        [/à|á|â/g,'a'],
        [/À|Á|Â/g,'A'],
        [/æ/g,'ae'],
        [/Æ/g,'AE'],
        [/ç/g,'c'],
        [/Ç/g,'C'],
        [/è|é|ê|ë/g,'e'],
        [/È|É|Ê|Ë/g,'E'],
        [/ì|í|î|ï/g,'i'],
        [/Ì|Í|Î|Ï/g,'I'],
        [/ñ/g,'n'],
        [/Ñ/g,'N'],
        [/ò|ó|ô/g,'o'],
        [/Ò|Ó|Ô/g,'O'],
        [/œ/g,'oe'],
        [/Œ/g,'OE'],
        [/ù|ú|û|ü/g,'u'],
        [/Ù|Ú|Û|Ü/g,'U'],
        [/ý|ÿ/g,'y'],
        [/Ý|Ÿ/g,'Y']
    ].forEach(
        x => string = string.replace(x[0], x[1])
    );
    return string
}
